<article class="article">
    <h1 class="page-title-h1">Лицей организовывает поездку во францию. 26 июня - 2 июля.</h1> 
    <h2 class="page-title-h2">Заголовок Н2</h2> 
    <h3 class="page-title-h3">Заголовок Н3</h3>
    <div class="text-block">
        <p >
            Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Какой-то подчёркнутый текст. Не следует, однако забывать, что консультация с широким активом способствует подготовки и реализации модели развития. 
        </p>  
        <h2 class="page-title-h2">Заголовок Н2</h2> 
        <p >
            Далеко-далеко за <b>словесными</b> горами в стране гласных и согласных живут рыбные тексты. Языком <a href="#">Ссылка</a> пустился власти рыбными! Рукописи залетают текстов всеми по всей океана заглавных? Рот пустился семь силуэт переулка, своих свой взгляд. Необходимыми свой залетают журчит рыбными по всей вопрос, дорогу если однажды текста домах имени точках безорфографичный, она ведущими возвращайся, пор семантика.
        </p>
        
        <ul>
            <li>Повседневная практика показывает, что реализация намеченных плановых заданий требуют определения и уточнения направлений прогрессивного развития. </li>
            <li>Не следует, однако забывать, что сложившаяся структура организации в значительной степени обуславливает создание модели развития. </li>
            <li>С другой стороны консультация с широким активом требуют определения и уточнения форм развития.</li>
        </ul>

        <ol>
            <li>Повседневная практика показывает, что реализация намеченных плановых заданий требуют определения и уточнения направлений прогрессивного развития. </li>
            <li>Не следует, однако забывать, что сложившаяся структура организации в значительной степени обуславливает создание модели развития. </li>
            <li>С другой стороны консультация с широким активом требуют определения и уточнения форм развития.</li>
        </ol>
    </div>
    
</article>

