<article class="article">
    <div class="article__head">
        <h1 class="page-title-h1">Лицей организовывает поездку во францию. 26 июня - 2 июля.</h1>
        <?php include ("_data-comments.html") ?>
    </div>
    <div class="article__content">
        <div class="text-block">
            <img src="./img/article-img-lg.jpg" alt="photo">
            <p >
                Значимость этих проблем настолько очевидна, что постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет выполнять важные задания по разработке направлений прогрессивного развития. 
            </p>  
            <h2>Заголовок Н2</h2> 
            <p >
                Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности обеспечивает широкому кругу (специалистов) <u>участие</u></span> в формировании соответствующий условий активизации. Какой-то <u>подчёркнутый</u> текст. Не следует, однако забывать, что консультация с широким активом способствует подготовки и реализации модели развития. 
            </p>
            <h3>Заголовок Н3</h3> 
            <p >
                Далеко-далеко за <b>словесными</b> горами в стране гласных и согласных живут рыбные тексты. Языком <a href="#">Ссылка</a> пустился власти рыбными! Рукописи залетают текстов всеми по всей океана заглавных? Рот пустился семь силуэт переулка, своих свой взгляд. Необходимыми свой залетают журчит рыбными по всей вопрос, дорогу если однажды текста домах имени точках безорфографичный, она ведущими возвращайся, пор семантика.
            </p>
            
            <ul>
                <li>Повседневная практика показывает, что реализация намеченных плановых заданий требуют определения и уточнения направлений прогрессивного развития. </li>
                <li>Не следует, однако забывать, что сложившаяся структура организации в значительной степени обуславливает создание модели развития. </li>
                <li>С другой стороны консультация с широким активом требуют определения и уточнения форм развития.</li>
            </ul>

            <ol>
                <li>Повседневная практика показывает, что реализация намеченных плановых заданий требуют определения и уточнения направлений прогрессивного развития. </li>
                <li>Не следует, однако забывать, что сложившаяся структура организации в значительной степени обуславливает создание модели развития. </li>
                <li>С другой стороны консультация с широким активом требуют определения и уточнения форм развития.</li>
            </ol>

            <p class="p-float-img">
                <img src="./img/article-img-lg.jpg" alt="photo">
                С другой стороны реализация намеченных плановых заданий играет важную роль в формировании форм развития. Значимость этих проблем настолько очевидна, что укрепление и развитие структуры в значительной степени обуславливает создание систем массового участия. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации соответствующий условий активизации. С другой стороны постоянный количественный рост и сфера нашей активности играет важную роль в формировании существенных финансовых и административных условий.
            </p>
        </div>
    </div>

    <div class="article__comments">
        <?php include ("_comments.html") ?>
    </div>
</article>

